In [3]:
import pandas as pd
import numpy as np

In [4]:
print(pd.__version__)

2.0.3

In [38]:
#mengacu pada video materi, bagian revisi ditaruh diakhir
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1,20, size=(n_rows,n_cols)),
                 columns=cols)
df['bil_pecahan']=df['bil_pecahan'].astype('float')

df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df = df.reset_index()

df['text'] = list('ABCDE')
df

AttributeError: module 'pandas.util' has no attribute 'testing'

In [39]:
df.dtypes

bil_pecahan    float64
bil_bulat        int32
dtype: object

In [40]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         19.0          4
1          8.0          1
2         16.0          6
3         18.0          9
4          7.0         12

In [41]:
df.select_dtypes(include='float')

   bil_pecahan
0         19.0
1          8.0
2         16.0
3         18.0
4          7.0

In [42]:
df.select_dtypes(include='int')

   bil_bulat
0          4
1          1
2          6
3          9
4         12

In [43]:
df.select_dtypes(include='object')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [44]:
df.select_dtypes(include='datetime')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [45]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat
0         19.0          4
1          8.0          1
2         16.0          6
3         18.0          9
4          7.0         12

In [74]:
# Mengacu pada revisi materi

n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1,20, size=(n_rows,n_cols)),
                 columns=cols)
df['bil_pecahan']=df['bil_pecahan'].astype('float')

df.index = pd.date_range(start='2023-10-01', periods=n_rows, freq='H')

df = df.reset_index()

df['text'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat text
0 2023-10-01 00:00:00          2.0          5    A
1 2023-10-01 01:00:00         14.0          9    B
2 2023-10-01 02:00:00          3.0         12    C
3 2023-10-01 03:00:00          1.0         11    D
4 2023-10-01 04:00:00         19.0          1    E

In [54]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
text                   object
dtype: object

In [55]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          5.0         16
1          1.0          8
2         17.0         14
3         12.0         17
4         12.0          9

In [56]:
df.select_dtypes(include='float')

   bil_pecahan
0          5.0
1          1.0
2         17.0
3         12.0
4         12.0

In [57]:
df.select_dtypes(include='int')

   bil_bulat
0         16
1          8
2         14
3         17
4          9

In [58]:
df.select_dtypes(include='object')

  text
0    A
1    B
2    C
3    D
4    E

In [59]:
df.select_dtypes(include='datetime')

                index
0 2023-10-01 00:00:00
1 2023-10-01 01:00:00
2 2023-10-01 02:00:00
3 2023-10-01 03:00:00
4 2023-10-01 04:00:00

In [60]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat text
0          5.0         16    A
1          1.0          8    B
2         17.0         14    C
3         12.0         17    D
4         12.0          9    E